78/comfort-board/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c3"

# Flash size: 4 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Power management: Auto light sleep via tickless idle
CONFIG_PM_ENABLE=y
CONFIG_PM_SLP_DEFAULT_PARAMS_OPT=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y

# FreeRTOS tickless idle - lets vTaskDelay() drop the CPU into light sleep
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# CPU frequency (PM treats this as max; scales down to XTAL when idle)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

# Console over UART0 so logs still flush around light sleep transitions
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- LVGL ---------------------------------------------------------------
# Drive LVGL entirely via Kconfig (no user-provided lv_conf.h). Runtime is
# trimmed: RGB565 color depth (our flush_cb quantizes to the panel's 2 bpp
# palette), custom tick supplied from esp_timer via lv_tick_set_cb(), no
# demos or runtime monitors.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=32
CONFIG_LV_DEF_REFR_PERIOD=500
CONFIG_LV_DPI_DEF=130
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_SYSMON=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_FONT_MONTSERRAT_14=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_MUSIC=n
